layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "cocottributes_multilabel_datalayers"
    layer: "CocottributesMultilabelDataLayerSync"
    param_str: "{\'im_shape\': [227, 227], \'label_ids\': [408, 409, 410, 411, 412, 413, 414, 415, 416, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615], \'split\': [462796, 547272, 755145, 444812, 168605, 4466, 467636, 168997, 245459, 633053, 354486, 134213, 866833, 222051, 98715, 624493, 750409, 358444, 293070, 137057, 5116, 766111, 546043, 592429, 411445, 268557, 735680, 746454, 444111, 476061, 620384, 194776, 294572, 378293, 26, 162412, 294578, 162683, 867800, 203125, 474739, 107068, 871396, 378070, 4650, 231047, 95779, 268082, 223613, 443898, 4722, 433042, 599689, 4387, 294435, 452262, 213149, 699545, 228069, 129944, 38810, 357350, 160371, 439374, 116428, 753530, 233028, 619049, 590987, 446980, 281505, 442044, 546134, 170653, 752217, 754427, 442166, 434293, 594929, 354005, 596882, 137808, 293089, 616416, 354179, 236614, 98387, 223576, 477554, 777969, 443673, 438777, 360831, 65732, 31623, 293942, 147534, 355679, 639274, 599021, 98440, 337561, 408341, 214138, 4667, 751389, 867084, 451152, 443277, 263839, 600353, 865275, 409873, 748988, 42480, 763832, 448873, 209679, 882663, 881877, 294260, 836723, 476836, 457231, 24363, 205489, 870403, 455297, 447155, 378654, 835140, 591055, 597662, 620040, 52135, 454558, 882149, 358440, 98647, 98695, 883557, 240861, 805481, 633339, 828631, 4355, 293090, 833480, 138419, 437190, 881892, 4360, 699585, 274879, 180006, 370460, 91043, 475648, 293457, 602159, 293006, 751748, 4416, 209590, 213678, 466078, 355738, 147489, 108838, 590779, 16847, 733574, 612662, 606910, 169649, 29620, 591837, 620726, 148728, 593542, 205439, 452756, 450221, 435963, 438432, 254835, 461562, 353738, 194878, 870375, 98691, 626284, 603555, 4449, 268901, 450545, 204275, 755534, 294202, 149009, 205650, 637623, 131157, 148629, 545783, 545086, 354142, 470320, 751192, 870756, 4359, 334244, 610287, 593112, 546462, 484360, 880337, 134811, 259496, 4453, 460465, 869645, 294683, 545020, 204399, 4435, 544828, 888672, 281333, 603055, 136225, 235267, 203955, 209738, 103042, 293848, 451508, 476171, 748244, 261763, 546263, 235497, 545999, 253893, 195142, 269132, 544779, 214431, 439400, 92619, 453014, 729653, 592745, 470057, 381645, 456430, 459230, 163083, 254973, 441413, 148073, 411183, 98785, 609460, 434799, 267612, 805204, 877641, 240877, 627110, 357584, 256974, 294366, 434561, 441441, 137934, 24894, 338982, 228563, 546853, 106715, 586596, 734048, 481175, 4487, 441745, 108280, 370013, 448133, 4397, 123022, 267846, 294054, 9357, 199574, 882566, 754379, 545366, 743724, 754144, 631850, 241059, 477658, 832492, 226250, 480291, 366009, 231103, 77239, 435828, 742922, 213416, 292913, 6171, 115280, 449320, 437858, 177492, 150429, 294069, 45220, 4648, 293782, 544943, 35704, 745822, 841262, 594759, 274922, 545574, 622373, 749931, 546611, 4554, 338985, 149176, 199695, 10098, 65609, 765411, 264002, 221604, 253357, 604196, 594932, 360154, 138829, 337604, 612243, 760255, 865856, 107353, 4788, 730709, 437157, 474793, 760875, 750079, 617623, 73205, 4530, 735199, 457152, 4740, 473887, 168038, 80357, 473952, 593157, 170844, 758105, 443482, 294346, 293663, 229046, 747011, 231100, 358710, 4390, 253296, 474952, 882474, 600480, 181253, 40053, 292870, 751554, 612451, 834682, 870141, 882529, 360683, 866857, 292086, 865054, 545195, 4543, 603344, 240912, 458813, 544816, 587337, 628496, 608291, 747091, 751094, 453221, 867859, 226538, 130223, 4378, 653934, 221406, 744287, 459014, 465718, 454325, 439159, 156512, 767186, 367657, 199444, 873023, 880400, 209772, 433406, 217279, 468905, 829259, 740446, 653922, 595384, 410251, 438254, 744201, 445839, 471064, 882685, 336013, 108821, 444199, 293274, 369302, 758036, 463641, 134272, 4374, 363346, 32819, 438373, 292754, 136212, 590778, 209817, 731213, 4614, 292543, 476832, 65670, 138962, 584863, 547328, 547405, 4343, 234619, 292040, 442853, 235875, 870213, 156117, 450445, 738514, 441662, 869932, 442799, 749645, 761034, 169164, 335919, 236729, 4596, 39256, 544934, 604907, 741680, 473803, 452241, 870635, 866327, 547119, 617529, 359736, 751779, 479811, 234279, 473682, 865243, 455056, 359189, 870476, 4940, 462330, 292228, 292970, 361857, 547132, 240972, 448761, 131126, 442630, 4448, 98563, 452560, 357603, 610574, 221043, 440197, 751529, 45928, 613440, 336889, 408375, 354118, 4508, 865992, 293152, 630489, 365326, 293171, 468546, 761180, 450218, 546557, 444427, 80620, 45556, 589028, 5087, 760235, 338938, 753896, 458122, 755790, 275313, 743869, 130071, 459123, 473085, 653911, 747576, 742008, 32849, 209871, 410940, 295125, 805447, 181970, 336128, 137779, 633706, 4326, 746328, 204640, 445257, 464567, 748641, 413285, 866407, 545945, 446048, 766310, 616973, 85909, 137418, 244845, 180424, 199617, 287462, 353885, 441216, 618357, 632508, 4440, 293135, 764968, 4755, 354599, 439321, 367060, 440017, 459999, 456422, 374074, 57884, 750464, 833847, 4715, 261242, 601475, 4493, 294155, 741364, 365557, 287412, 458466, 4629, 444837, 470249, 356127, 742122, 869656, 481325, 470213, 293929, 163724, 460493, 765367, 191803, 441772, 86803, 4710, 759771, 437506, 263788, 455478, 136820, 137202, 603656, 870280, 615944, 459440, 409478, 450959, 274850, 294671, 358421, 835734, 378465, 444506, 240977, 836371, 292014, 31744, 545323, 339187, 594135, 241174, 454553, 439992, 147046, 287406, 444196, 294767, 368091, 741119, 293049, 203461, 260965, 235274, 441424, 871473, 292910, 164998, 441901, 756873, 4866, 437871, 545226, 293619, 545470, 293962, 294351, 595292, 254673, 334977, 457955, 170848, 231345, 805500, 777993, 871477, 620400, 70694, 756739, 294840, 443889, 210065, 480045, 65558, 443385, 359622, 867515, 545855, 867244, 122354, 629556, 4500, 38580, 23832, 589255, 759754, 368064, 361465, 865475, 434671, 203227, 483321, 745471, 45439, 484198, 865814, 114295, 379554, 545310, 336223, 481485, 592335, 356490, 464249, 4651, 4630, 294297, 547527, 364632, 295138, 743302, 269023, 293026, 867210, 778028, 371387, 442281, 131324, 4339, 228009, 4695, 830307, 742425, 170142, 546636, 74018, 195884, 829881, 883252, 360363, 466297, 125151, 355937, 627404, 24618, 805405, 363245, 369959, 86832, 468545, 619213, 5492, 457725, 602776, 254333, 64706, 106595, 433880, 108311, 442486, 472754, 877587, 409390, 461613, 102825, 457029, 293041, 35155, 235302, 367114, 483806, 445735, 205082, 4428, 869146, 591911, 468836, 831963, 592071, 468204, 831180, 749721, 199707, 171515, 452952, 636333, 39546, 869560, 440119, 882890, 866422, 868191, 263679, 202944, 453189, 610146, 102435, 45545, 379091, 368442, 477170, 292808, 870763, 98687, 413119, 3019, 4401, 292491, 7772, 335199, 777946, 758511, 373665, 367555, 437655, 275004, 9749, 744457, 50518, 743453, 108528, 170625, 882210, 206354, 623449, 244968, 268560, 469183, 653965, 364508, 546019, 459376, 294944, 241137, 545647, 364395, 165187, 180156, 443943, 131113, 445424, 452615, 169459, 240940, 745871, 267515, 164703, 545944, 613607, 4626, 752826, 4556, 877569, 453132, 752099, 743549, 466349, 450708, 107029, 164923, 880429, 334340, 435174, 338168, 447508, 373645, 740629, 293085, 85885, 589570, 546286, 465833, 625212, 588974, 222258, 440176, 281455, 740940, 293978, 468864, 870565, 263804, 546607, 441600, 294795, 293308, 845931, 630368, 292652, 203656, 460607, 131332, 447091, 761989, 452364, 607168, 453871, 857180, 865878, 372618, 108741, 741809, 90707, 627219, 461784, 545628, 609626, 596130, 254603, 544894, 235148, 828288, 458990, 469983, 73646, 623801, 466773, 545085, 623725, 742492, 865170, 476000, 546284, 588440, 469371, 199764, 177418, 439940, 460925, 136823, 359388, 204010, 4703, 357041, 746674, 452376, 367639, 805441, 256983, 355677, 275209, 444793, 479925, 545254, 372607, 293227, 473368, 64714, 146801, 156456, 61502, 753171, 171101, 465512, 363201, 457606, 612582, 451758, 451655, 547255, 24896, 753981, 547594, 356033, 867359, 91428, 368869, 465941, 233881, 98315, 446050, 883069, 453159, 442762, 623528, 98866, 743460, 179816, 456778, 101485, 743187, 455944, 177476, 547176, 636750, 462679, 444777, 612278, 116034, 760781, 367649, 544794, 436080, 112122, 444967, 241000, 463948, 441253, 434111, 156359, 98908, 268746, 133312, 545379, 4443, 244449, 203023, 4539, 370071, 888835, 733124, 546877, 547499, 131351, 268489, 292355, 450373, 753873, 749460, 587691, 231426, 355096, 117214, 410780, 827414, 545609, 108025, 447256, 589835, 4394, 58629, 81000, 483446, 467127, 4515, 764867, 4456, 291986, 467095, 752522, 438006, 292454, 274267, 435149, 4741, 4333, 4398, 440447, 294110, 107738, 778086, 546129, 445365, 866416, 547113, 367850, 362738, 459498, 480450, 51464, 611535, 131261, 131207, 4705, 337469, 750422, 148462, 147747, 336398, 449245, 460827, 4589, 287385, 287388, 24392, 449935, 84209, 699653, 32917, 440732, 636885, 4586, 4674, 836595, 4708, 280889, 292738, 268732, 165159, 480903, 587084, 409534, 764399, 353431, 334428, 745019, 410206, 357576, 752906, 740377, 292160, 364560, 292238, 471334, 259015, 38761, 435496, 866717, 109580, 591294, 476075, 133117, 281786, 209274, 131289, 479346, 360652, 241058, 50216, 51447, 435226, 168239, 591251, 871392, 369664, 473165, 753607, 337701, 228314, 294320, 205178, 353280, 267324, 751143, 180641, 408550, 64682, 758375, 209599, 408311, 373109, 828769, 434160, 294083, 748937, 146871, 171131, 281710, 80614, 357859, 29645, 267273, 625838, 605533, 442482, 436706, 546487, 292989, 734683, 547545, 4716, 588989, 168795, 455625, 130761, 866132, 457420, 618053, 231071, 4352, 181586, 100373, 294528, 462992, 4420, 4623, 454769, 32897, 375307, 596904, 457504, 98623, 465147, 4338, 293243, 442905, 32346, 453029, 133399, 98912, 624848, 4348, 209802, 411496, 131214, 444083, 169855, 293495, 293847, 610632, 169064, 459625, 254839, 741860, 545351, 450415, 169310, 163898, 84535, 460349, 241168, 138996, 462676, 459024, 436572, 292175, 235282, 739700, 106801, 294878, 293139, 4407, 367066, 471323, 9331, 620365, 4444, 281682, 139425, 766491, 437343, 452942, 756495, 450728, 438936, 470604, 749560, 462905, 412212, 214626, 337272, 465589, 217396, 169863, 281882, 281548, 372457, 433211, 461297, 589098, 4572, 466341, 123624, 866195, 757887, 435567, 437714, 757795, 442233, 742309, 606399, 45456, 746638, 474707, 457477, 4559, 869459, 636353, 544809, 17164, 203859, 374504, 108060, 180376, 168531, 294438, 146037, 150074, 626482, 106889, 294119, 236854, 80316, 449650, 754086, 545601, 358862, 102172, 199352, 545028, 836956, 365429, 5268, 214551, 293696, 615459, 267327, 171399, 461818, 4468, 545413, 866379, 250428, 164791, 441871, 209263, 868551, 188613, 753427, 138023, 360711, 234233, 210068, 267671, 437256, 4452, 449832, 355258, 597279, 545659, 435132, 355784, 363942, 467527, 436234, 483650, 136227, 456976, 443448, 269295, 864327, 40549, 699472, 214034, 446818, 294112, 292603, 168191, 365976, 361375, 292320, 4472, 455205, 481549, 883628, 632139, 631195, 108028, 363233, 443083, 584049, 261081, 108155, 593136, 434812, 611162, 206062, 275672, 474509, 469618, 742670, 546779, 137222, 204816, 743616, 336282, 240942, 204635, 867068, 188147, 750231, 306614, 464549, 51866, 588291, 292894, 168116, 362540, 413852, 4402, 196654, 157444, 434403, 294020, 234712, 744525, 829491, 114480, 441458, 443717, 445880, 754010, 199807, 866986, 467434, 441646, 114739, 545597, 136626, 167574, 360139, 353525, 604779, 269275, 17564, 102860, 751497, 450149, 547002, 357416, 195037, 468531, 4625, 358014, 4607, 754038, 865546, 91442, 194937, 764315, 766074, 454175, 544915, 84844, 477052, 4658, 699181, 544876, 741782, 361611, 742610, 98882, 107304, 354758, 268196, 74167, 4622, 460768, 71065, 742535, 627024, 442333, 358521, 272044, 444526, 593959, 188652, 440464, 195972, 805203, 131115, 64580, 452382, 293201, 612173, 107997, 114841, 269185, 98072, 606681, 104, 546311, 449703, 760299, 136895, 469356, 374239, 756861, 467749, 450548, 805371, 866509, 765881, 365938, 137538, 408865, 871474, 4725, 131117, 293125, 353785, 882922, 455679, 367892, 837841, 4434, 353635, 545401, 179719, 234284, 234333, 454082, 750780, 433513, 84144, 866829, 445788, 612030, 91923, 865252, 445862, 205588, 116667, 546116, 590914, 481163, 439473, 595621, 447422, 545895, 757363, 379997, 204258, 64675, 805434, 335006, 3226, 358133, 475106, 741525, 434144, 748115, 4367, 77869, 470068, 214299, 204696, 4513, 754400, 131333, 196638, 209462, 80932, 461345, 4581, 442372, 358425, 221780, 759121, 4478, 438535, 4753, 162247, 244075, 478169, 32858, 360749, 204882, 255461, 623683, 293030, 464917, 70795, 334564, 629468, 339227, 147396, 439010, 107278, 438741, 483312, 470580, 40154, 260913, 131217, 438607, 293731, 471339, 460738, 877591, 477944, 547118, 133804, 73949, 456193, 449708, 98600, 4579, 162561, 51104, 434958, 4353, 446689, 473234, 247468, 42326, 4647, 293244, 169672, 335049, 130002, 4460, 545484, 737978, 210056, 472579, 366011, 594454, 4750, 195995, 476620, 287500, 258817, 883453, 442916, 294836, 440965, 592281, 65490, 587116, 744702, 470951, 627955, 4371, 84448, 35161, 730468, 624005, 368788, 188180, 274960, 614210, 478763, 547330, 545725, 592109, 263923, 744368, 459861, 181534, 367239, 437543, 616500, 871663, 408466, 867005, 882918, 469666, 98625, 630064, 759124, 205974, 593164, 234835, 188258, 108253, 621627, 74048, 52, 865639, 747378, 457151, 108314, 293791, 433742, 412050, 4739, 699480, 831344, 617438, 545721, 601383, 108582, 169637, 3218, 612488, 601338, 137554, 749528, 205556, 362368, 871372, 262151, 433409, 464511, 368875, 221589, 630828, 461164, 116710, 447201, 4635, 4400, 443505, 9020, 467931, 464342, 866579, 267854, 4518, 235257, 4568, 380886, 109299, 439155, 618656, 293478, 109111, 762204, 735111, 805353, 268567, 361517, 80386, 213418, 4551, 448000, 41101, 106708, 170048, 451247, 50915, 441087, 293597, 4362, 752027, 450541, 209393, 742639, 586602, 733940, 546638, 450710, 882649, 440728, 98580, 209597, 868964, 634112, 293660, 619406, 436262, 199522, 109241, 73621, 882438, 74823, 882494, 446852, 292071, 440100, 633444, 366102, 364773, 473654, 51647, 268236, 436275, 31739, 292069, 805410, 435352, 478324, 757789, 471505, 634290, 882751, 754409, 241015, 739970, 867980, 444569, 604422, 274232, 835950, 446365, 24088, 4483, 364753, 377405, 452064, 95298, 474938, 292877, 439905, 235877, 101773, 98818, 472457, 412707, 357911, 448104, 374986, 459163, 162638, 547264, 444400, 64679, 354275, 170907, 4602, 209538, 869136, 768655, 6265, 199850, 600546, 472724, 293075, 45694, 70691, 209846, 81127, 608563, 880356, 434761, 199600, 4642, 42818, 4523, 38710, 607550, 867576, 882558, 445608, 545896, 267435, 261307, 453969, 205538, 244394, 181873, 4668, 188319, 233027, 366572, 168202, 831309, 356621, 4582, 439773, 181521, 364401, 234601, 194938, 473753, 456681, 805360, 449718, 357185, 439526, 743365, 168544, 622655, 447431, 168874, 65757, 56990, 748957, 546047, 71277, 368965, 462779, 256970, 435004, 409827, 294501, 433161, 480046, 116709, 281344, 458666, 764969, 883196, 443564, 106867, 866134, 25432, 610720, 413268, 108239, 293634, 637005, 134010, 759323, 294079, 756091, 732166, 4972, 199785, 237093, 4332, 699664, 364028, 448168, 5453, 828384, 365480, 743482, 740185, 165069, 195953, 546739, 244363, 545372, 731898, 235289, 607894, 743027, 293067, 458385, 864596, 621581, 882088, 209277, 623312, 596609, 591878, 287327, 829798, 604998, 443630, 455015, 766494, 136499, 293397, 293133, 830986, 368540, 441926, 742765, 292712, 107546, 115118, 749888, 136565, 653870, 235094, 616018, 4656, 294117, 240874, 4417, 743235, 763737, 77597, 170022, 449317, 413295, 595520, 447286, 204483, 80639, 294947, 746386, 179814, 756305, 203729, 470441, 584653, 4415, 95187, 439122, 454048, 86360, 369892, 409399, 76, 596209, 766753, 131103, 733102, 214775, 602206, 443956, 65694, 546439, 196632, 866395, 547231, 371095, 9629, 293927, 435985, 743702, 294017, 4654, 267630, 439471, 752407, 368035, 379258, 454886, 450855, 180109, 546943, 870747, 747512, 355279, 413550, 170925, 601370, 446414, 836998, 39000, 755657, 882334, 460700, 4363, 437043, 546260, 589431, 778092, 546500, 90746, 361466, 381039, 4646, 137812, 51848, 228045, 131234, 759283, 469502, 260939, 4419, 472551, 866313, 872222, 136219, 869479, 761765, 217257, 473526, 377991, 136828, 205864, 738567, 102005, 73478, 442458, 294440, 871204, 362707, 268875, 746389, 38632, 4574, 865944, 232913, 444404, 294779, 869356, 292257, 196013, 626097, 761403, 205889, 456730, 4760, 171539, 7611, 278882, 267260, 749887, 593220, 253942, 889362, 167846, 115230, 236931, 610168, 147158, 747015, 122864, 477994, 168003, 244902, 268584, 65716, 295000, 463135, 827266, 294413, 98587, 131227, 294278, 480804, 58117, 368894, 134115, 4616, 45853, 882105, 267381, 356078, 544930, 213802, 593550, 38748, 180121, 4502, 699461, 609983, 829864, 610163, 408179, 449810, 57957, 209301, 457945, 9652, 200047, 131274, 4467, 162246, 762564, 4842, 359555, 438410, 479794, 4639, 362701, 544793, 146045, 293406, 133313, 610169, 622895, 167670, 545682, 627866, 294128, 409122, 749471, 457325, 547062, 4497, 32772, 742528, 209929, 468722, 473028, 4548, 366617, 465686, 466307, 247059, 101692, 622125, 168358, 865064, 632136, 445485, 98846, 294956, 435211, 355841, 545904, 169658, 622313, 545148, 4484, 236119, 337405, 622602, 440252, 51435, 439939, 4489, 180149, 51636, 452861, 202937, 453263, 136801, 827714, 628333, 244641, 4583, 758715, 865644, 228037, 148531, 356575, 805307, 339935, 873001, 440014, 246635, 434459, 632127, 545207, 599538, 464463, 438207, 295100, 737055, 463608, 294206, 546064, 596079, 170212, 4575, 545036, 188470, 759846, 4344, 444925, 603901, 606562, 98397, 467813, 463002, 466646, 98568, 596493, 98831, 4327, 80978, 204059, 868366, 4744, 597674, 338073, 468959, 626641, 736917, 607198, 168894, 750812, 436286, 412837, 619928, 475503, 114587, 591857, 188407, 221487, 596967, 294733, 261077, 742792, 4528, 209796, 466739, 453048, 4746, 752770, 446131, 767379, 456738, 209717, 339638, 461695, 452559, 101483, 439388, 4557, 355304, 467534, 24517, 410922, 446934, 469957, 4558, 4661, 434908, 380011, 246652, 735985, 365866, 4591, 410430, 4450, 699214, 4410, 440462, 137004, 587625, 4356, 467634, 449783, 888637, 4531, 460991, 546904, 4717, 827300, 440598, 544743, 4442, 544985, 4641, 622527, 268037, 756128, 360091, 871575, 744840, 735610, 293222, 294004, 355433, 441759, 131141, 757700, 137381, 620516, 137516, 604549, 4354, 168160, 546171, 334878, 757527, 274741, 444294, 267454, 169334, 461981, 334192, 204840, 160356, 545334, 4437, 196615, 472296, 476334, 49979, 58209, 64665, 18106, 131221, 439831, 745931, 754445, 281860, 294993, 114873, 593521, 361920, 592288, 471447, 169150, 461400, 622622, 65629, 482072, 254925, 750625, 365949, 365482, 4595, 237363, 293556, 98483, 753200, 74105, 204627, 477200, 4594, 870031, 468991, 445226, 9791, 460609, 457008, 476320, 475023, 632838, 447972, 412319, 739367, 450298, 364754, 4588, 203562, 868666, 865192, 4576, 226519, 156417, 545327, 741898, 204491, 17481, 267214, 39366, 292210, 412711, 870175, 871242, 546536, 359820, 209761, 170057, 281119, 459341, 240893, 866323, 294215, 545176, 741079, 4567, 180859, 434344, 367811, 470035, 232910, 246601, 209624, 625758, 281394, 4464, 217343, 460382, 446047, 477652, 209657, 445130, 445287, 4439, 434571, 274399, 369481, 294502, 101475, 756367, 362072, 546189, 38896, 635243, 882078, 619991, 587936, 359177, 4438, 464029, 226647, 469936, 4676, 462285, 127831, 465769, 65334, 162471, 4731, 440128, 70970, 269277, 458190, 78104, 358859, 483548, 546070, 38562, 355577, 409707, 334793, 195012, 167420, 545963, 4421, 870590, 454902, 445348, 205615, 4384, 445155, 752172, 737840, 39620, 412818, 4604, 750423, 168748, 292765, 108222, 281530, 439818, 627807, 454272, 370496, 292916, 871831, 447012, 367116, 653842, 460236, 468726, 4721, 357373, 606458, 366328, 358379, 171706, 865844, 98918, 334223, 365398, 260926, 4612, 366521, 162585, 829126, 436103, 360332, 461652, 831648, 4562, 261010, 64622, 589311, 591120, 462963, 4598, 444377, 546800, 162565, 24185, 50237, 435846, 546806, 457918, 447257, 865800, 170401, 756308, 475513, 4681, 451842, 444978, 199873, 444510, 882325, 64833, 35359, 868692, 4445, 455728, 450318, 362876, 281584, 587694, 459703, 355510, 445625, 411439, 294846, 752506, 731810, 443704, 547136, 765703, 131321, 139374, 267905, 469326, 133048, 452595, 230993, 98923, 433203, 597284, 187426, 444914, 281790, 471357, 182164, 209724, 870951, 592223, 546759, 363144, 293175, 438158, 80657, 244119, 292446, 410384, 458035, 275611, 45069, 4469, 455710, 228190, 545853, 363237, 545560, 638334, 4569, 591783, 433056, 272047, 835691, 618019, 357140, 458798, 209419, 134080, 874828, 457355, 372448, 545488, 730988, 293740, 194971, 4659, 293356, 620734, 32782, 435893, 456010, 441099, 236665, 261175, 267801, 546375, 359155, 545543, 546669, 740430, 355681, 753459, 169816, 741976, 4550, 131083, 620440, 461600, 435594, 414667, 436379, 473193, 639293, 609117, 641240, 608761, 833033, 882874, 413516, 545147, 294381, 370200, 871441, 133172, 605975, 546193, 362119, 209417, 480224, 757441], \'batch_size\': 128}"
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 11
    group: 1
    stride: 4
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    stride: 1
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    stride: 1
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    stride: 1
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "score"
  type: "InnerProduct"
  bottom: "fc7"
  top: "score"
  inner_product_param {
    num_output: 204
  }
}
layer {
  name: "loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "score"
  bottom: "label"
  top: "loss"
}
