layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "cocottributes_multilabel_datalayers"
    layer: "CocottributesMultilabelDataLayerSync"
    param_str: "{\'im_shape\': [227, 227], \'label_ids\': [408, 409, 410, 411, 412, 413, 414, 415, 416, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615], \'split\': [546398, 699348, 601692, 434723, 114430, 209799, 228859, 545185, 358359, 449197, 4680, 4669, 169134, 365033, 267201, 763787, 547036, 733322, 764525, 469231, 380642, 353533, 108265, 443332, 545677, 369329, 440992, 204701, 408594, 637062, 98318, 375374, 4432, 4423, 177420, 358581, 436034, 4399, 4561, 805280, 9076, 4532, 98635, 77129, 618448, 363065, 595112, 167312, 146032, 601169, 464681, 731318, 452440, 101425, 451045, 203831, 448685, 465036, 627296, 363524, 450917, 469049, 867816, 98505, 362216, 204098, 464956, 611467, 634048, 369787, 443709, 260983, 435748, 591339, 448488, 757444, 206137, 450379, 370247, 167805, 446793, 189398, 615656, 4702, 235437, 827985, 64659, 4585, 625422, 241172, 108173, 236103, 466647, 460135, 634655, 39081, 834105, 442308, 254985, 442983, 137921, 448917, 24349, 268076, 743143, 740761, 237076, 739333, 410869, 254116, 455424, 452987, 839552, 867563, 453090, 50818, 869790, 62517, 361127, 335643, 437117, 189204, 108901, 411272, 292761, 870928, 205786, 544811, 209707, 866291, 871118, 594114, 177489, 869582, 221452, 4603, 413122, 162405, 363782, 451036, 599807, 454009, 50345, 98517, 764040, 547180, 591913, 363611, 358297, 293048, 16445, 633367, 872224, 267957, 4389, 209454, 146917, 228884, 607700, 872672, 459146, 4613, 39467, 461085, 5029, 234910, 743690, 587282, 131181, 599880, 546424, 371675, 98550, 472848, 356377, 614418, 209519, 221518, 456705, 602348, 371900, 136190, 869157, 754399, 246195, 360164, 361518, 733826, 131232, 639769, 546760, 871550, 4490, 266221, 209570, 864306, 411022, 699588, 229269, 294391, 267817, 27992, 4511, 187790, 544887, 433455, 618715, 741037, 379652, 4571, 461621, 746455, 544942, 604088, 477064, 147180, 18036, 108005, 590800, 293150, 367688, 295022, 742221, 596731, 334459, 444279, 379684, 240967, 446435, 469160, 4747, 882697, 444968, 546288, 171357, 755474, 612494, 480860, 545864, 734485, 640473, 4413, 281893, 294071, 45369, 80654, 360495, 23794, 437817, 4720, 146783, 5319, 39439, 4386, 32360, 589109, 653852, 293629, 440103, 595416, 4465, 545984, 639551, 882508, 294038, 615446, 458257, 292679, 359801, 864677, 234009, 434546, 222212, 165148, 366200, 868274, 171704, 4573, 373479, 135633, 437056, 199575, 4521, 741010, 471176, 57531, 482968, 867588, 545466, 147429, 35499, 237042, 435727, 441074, 209902, 412031, 868639, 199593, 357710, 433703, 445811, 622054, 449758, 235371, 286787, 228341, 757796, 362388, 354268, 209755, 294283, 107, 292093, 619020, 102278, 292080, 131216, 131165, 4723, 546268, 608445, 363771, 115319, 228327, 412216, 857125, 292636, 459784, 98736, 107008, 447471, 292932, 274428, 292737, 699291, 8941, 444292, 223573, 4517, 261120, 449873, 448113, 457534, 546871, 619937, 598525, 114961, 870817, 356649, 462800, 4524, 474458, 754869, 293549, 371673, 354366, 440428, 234056, 746349, 355286, 378947, 476379, 458468, 336354, 474848, 460838, 294227, 546681, 107316, 444129, 137901, 32862, 747996, 4653, 886981, 370176, 484457, 436609, 32829, 465566, 593108, 108976, 434423, 456115, 763768, 171520, 545070, 39941, 334591, 752752, 870000, 766579, 294494, 360999, 471324, 480330, 196668, 109680, 546510, 4479, 199817, 209306, 362555, 463787, 50626, 366193, 735536, 157153, 451714, 729557, 171354, 209883, 545808, 4366, 468266, 73666, 364542, 864415, 632401, 355317, 227178, 268016, 777966, 10184, 482031, 4955, 354798, 621480, 450442, 883218, 544882, 459336, 209832, 443134, 138416, 244013, 434894, 451466, 546391, 629993, 209489, 287399, 293472, 805382, 870881, 287363, 368547, 834508, 98909, 353740, 52945, 70689, 294562, 374182, 268150, 131097, 449218, 205618, 292169, 244315, 4480, 65768, 866248, 133657, 214295, 446919, 162408, 123403, 234345, 228093, 409121, 354482, 4660, 546671, 462980, 469698, 584674, 867711, 45575, 156503, 294161, 245575, 214882, 835427, 353537, 864885, 180726, 45325, 439795, 448522, 462624, 155709, 292246, 547199, 4474, 108231, 440931, 762300, 4624, 77303, 734749, 449853, 4393, 608266, 293450, 759813, 334505, 869855, 590634, 365662, 547506, 461340, 545100, 168759, 161041, 269026, 293713, 206070, 453676, 115265, 335880, 699538, 438121, 168855, 209514, 433349, 4601, 222267, 458331, 458877, 32899, 45764, 734661, 867432, 4560, 131326, 437666, 545870, 122722, 442690, 364575, 245473, 369755, 16474, 372549, 32786, 131322, 194812, 188768, 45170, 470150, 433262, 619872, 293763, 759689, 74422, 621215, 287585, 441520, 475223, 136874, 235878, 157082, 547172, 372565, 209405, 445974, 547088, 293379, 98798, 585249, 435447, 446243, 194906, 614125, 73999, 4381, 442474, 4564, 236001, 4429, 293166, 130634, 446314, 468049, 751259, 235611, 868472, 805387, 168993, 234042, 123873, 441462, 293539, 612886, 869228, 475436, 745393, 167641, 177423, 4509, 24504, 294309, 204717, 130080, 57214, 472721, 653968, 765137, 209370, 98655, 605366, 4689, 443470, 213838, 217272, 751464, 85002, 195871, 547522, 122796, 458644, 294082, 295024, 139134, 360300, 81366, 98542, 98917, 98514, 546130, 287499, 483592, 764579, 460211, 24605, 256973, 408588, 287444, 334749, 609677, 4392, 869354, 455879, 167430, 769008, 465277, 164989, 615480, 412580, 213776, 293876, 471055, 167601, 98393, 451021, 4665, 361993, 24037, 463060, 547248, 834093, 362976, 743148, 478945, 454898, 4372, 106787, 828941, 353806, 168509, 699368, 168339, 45201, 751732, 4455, 90, 4542, 281762, 749464, 470854, 473520, 468037, 446305, 4701, 857177, 181500, 446004, 101779, 845980, 9025, 4526, 355434, 354679, 453111, 469328, 603761, 292690, 619724, 444179, 546572, 4662, 482962, 593937, 4697, 545362, 868529, 869975, 619305, 234017, 4382, 610216, 867341, 434286, 598375, 4745, 466793, 745610, 435773, 460273, 378441, 199525, 358903, 162509, 294374, 653897, 737714, 869170, 629930, 755819, 449715, 587044, 84077, 45239, 473369, 337694, 204492, 411134, 434225, 606983, 460863, 31590, 547361, 545200, 336215, 189410, 335077, 585637, 436953, 460238, 457489, 378824, 9201, 357087, 336287, 367581, 466036, 361413, 745463, 442798, 447882, 457524, 236318, 869007, 865229, 479904, 196610, 293324, 608214, 463866, 167355, 293143, 205095, 91586, 361323, 188153, 481461, 244238, 108362, 131158, 50288, 882184, 360353, 292560, 77683, 736979, 740724, 85153, 355972, 4671, 590503, 361818, 545626, 457900, 223558, 131088, 136994, 294287, 434510, 293918, 107085, 170873, 4726, 4707, 434466, 194854, 4335, 454378, 294735, 613879, 436257, 748323, 546738, 867225, 292695, 221190, 880333, 228085, 18071, 752393, 461368, 4334, 39296, 438216, 362452, 234766, 445158, 292420, 204734, 205671, 133782, 868124, 353427, 357519, 263824, 337576, 215369, 443237, 366268, 378011, 865601, 437915, 699528, 464587, 440346, 241147, 293745, 32825, 870699, 829291, 751253, 607722, 161084, 261766, 756314, 365384, 545000, 450929, 870013, 356884, 116227, 411240, 267210, 621708, 411226, 454752, 162249, 162432, 254476, 133334, 246759, 443897, 434632, 440553, 629568, 546075, 473831, 865204, 758466, 598575, 148305, 360225, 460405, 105, 2991, 228135, 281413, 244073, 610362, 240990, 292766, 760439, 370165, 409915, 209961, 871687, 4328, 442652, 77243, 293449, 274729, 267733, 4492, 472652, 3066, 440184, 156451, 462836, 413520, 453400, 437734, 209927, 869042, 442085, 4361, 354155, 461551, 438039, 107340, 593875, 4742, 457225, 131210, 4673, 5123, 443296, 31636, 168085, 857135, 629403, 365780, 354290, 453794, 545950, 451600, 356924, 369011, 254574, 209897, 281457, 699547, 757922, 356749, 447874, 117209, 4633, 546270, 882967, 108218, 545374, 445268, 75699, 869071, 235664, 267771, 883596, 733621, 869761, 871696, 221608, 292136, 443252, 203800, 882360, 839117, 478217, 459281, 254184, 445715, 358585, 204845, 745007, 292503, 4549, 467566, 746202, 17339, 465943, 133946, 129563, 443329, 612411, 457684, 4412, 753663, 628430, 292019, 364940, 294913, 97126, 610225, 411295, 437045, 411812, 481269, 868950, 334250, 463633, 226335, 461097, 751746, 453269, 355120, 436458, 4454, 222021, 546765, 74688, 699580, 888827, 32926, 411130, 759780, 4357, 231207, 478682, 281913, 294595, 354200, 4501, 122793, 24738, 269242, 4536, 545012, 169387, 546112, 545528, 745306, 440271, 459343, 195048, 360414, 241163, 453534, 835749, 455065, 357898, 453728, 164862, 98689, 106585, 882575, 4446, 147789, 437958, 254505, 244223, 459167, 547094, 434674, 234444, 611593, 35216, 450081, 869658, 374440, 743684, 4365, 64541, 189084, 413411, 623721, 635245, 199411, 268030, 625564, 619005, 80481, 545026, 209430, 738381, 778038, 481355, 747704, 209997, 457300, 588233, 544802, 62508, 203627, 740683, 4346, 114345, 39555, 864919, 293373, 108880, 292759, 168684, 293836, 236284, 39931, 227173, 755626, 106965, 838775, 235808, 363169, 454530, 449688, 294019, 546716, 443353, 760719, 453946, 747078, 221674, 746826, 227159, 546495, 3239, 356428, 368941, 4495, 157101, 4507, 447960, 261970, 98626, 545242, 871918, 750212, 742648, 209740, 269285, 16549, 757107, 199358, 25, 741701, 73369, 832045, 866660, 292909, 234071, 865796, 586550, 148746, 77553, 4593, 467887, 443397, 756387, 168821, 146837, 475699, 196, 436930, 209286, 180692, 479580, 545534, 294318, 748423, 886931, 115013, 334476, 544799, 5164, 864577, 476504, 236986, 240870, 107587, 753362, 4519, 619071, 335638, 4580, 602056, 361202, 626282, 204298, 129958, 448802, 760281, 594410, 441848, 373820, 108573, 221319, 440784, 870230, 372342, 453121, 156649, 357396, 337181, 203964, 4634, 440363, 294394, 165129, 868695, 409608, 293360, 294451, 605347, 877617, 108209, 464992, 38927, 544847, 253185, 194808, 545230, 146714, 465307, 544947, 377457, 64518, 355673, 609792, 756139, 882225, 31785, 131270, 467495, 98771, 169735, 631759, 293797, 454275, 600254, 334717, 334608, 4709, 592022, 293871, 744330, 545705, 4494, 409117, 188472, 752008, 244820, 456857, 453478, 449917, 116933, 368158, 748939, 471844, 4368, 274746, 292498, 601977, 241050, 448012, 866136, 4461, 477962, 156576, 294967, 204741, 4618, 209338, 867982, 233963, 753154, 228053, 591378, 194969, 440926, 181410, 167615, 439084, 464809, 136986, 292102, 473822, 203552, 439131, 731280, 586867, 294067, 267888, 73295, 356976, 4547, 236806, 471576, 751368, 614182, 435869, 457880, 739804, 149135, 194769, 294603, 408022, 466730, 443111, 362495, 588600, 451519, 755834, 458650, 458409, 481955, 221527, 115310, 742234, 362234, 179888, 156702, 275077, 255597, 778139, 477882, 4488, 745438, 865010, 546141, 292508, 101679, 114969, 336373, 589456, 468509, 746265, 699389, 123435, 438285, 4330, 633009, 209588, 292218, 191790, 474950, 98686, 414714, 436173, 204947, 356228, 866019, 472944, 827612, 606821, 25316, 448419, 221567, 462299, 39347, 306631, 138740, 545506, 107319, 471311, 750157, 591656, 738396, 98439, 463584, 547206, 546404, 435273, 590733, 729823, 734004, 367590, 750003, 372473, 434631, 109671, 292812, 439570, 261783, 337866, 235793, 51776, 361111, 81019, 188156, 268768, 587540, 292197, 74160, 466522, 886917, 446094, 472700, 870499, 452561, 730617, 209573, 131283, 442011, 107652, 871826, 447089, 408318, 293783, 4525, 751415, 872076, 114391, 4675, 601786, 292407, 838503, 451735, 462165, 360465, 450436, 462297, 381759, 443633, 871230, 433554, 381816, 411861, 445129, 4350, 867398, 743767, 373072, 292869, 751511, 136095, 261031, 832747, 244474, 598389, 334983, 235133, 4345, 38778, 411009, 235004, 589072, 354806, 438656, 478612, 175, 123018, 593391, 545733, 597796, 634516, 470120, 334335, 477166, 180747, 468582, 866930, 205238, 546485, 620699, 593249, 865738, 170242, 4677, 70796, 631640, 380094, 631796, 466693, 463022, 745880, 584186, 600714, 545701, 614165, 50607, 4538, 123013, 444606, 805443, 439280, 463040, 740553, 631871, 460897, 752756, 105963, 615598, 778081, 636875, 440562, 98488, 546048, 4369, 587054, 355233, 598207, 470972, 464689, 292324, 274696, 380947, 367192, 468694, 468953, 547484, 468192, 451869, 871282, 472249, 469927, 209472, 453618, 294024, 464565, 3172, 294109, 379389, 4620, 447614, 468062, 611729, 588550, 888685, 146679, 210040, 865209, 368735, 274843, 778131, 740557, 38918, 602726, 475451, 463091, 98741, 584238, 547222, 73146, 128003, 243990, 3164, 869223, 109600, 363383, 371499, 57668, 41248, 235714, 608019, 263880, 871815, 133447, 4482, 281669, 367671, 752157, 16866, 462654, 240876, 85647, 231089, 177482, 465970, 35732, 381166, 106696, 448474, 866471, 170884, 4696, 109782, 866790, 358996, 454712, 108072, 370932, 741043, 209381, 4510, 839167, 451446, 24446, 287568, 458488, 767777, 149428, 170601, 94930, 459321, 123196, 444946, 287586, 597349, 831894, 746123, 632922, 594880, 367405, 209765, 409475, 38930, 457651, 62295, 630696, 624224, 205837, 106764, 240918, 4578, 62180, 38599, 39404, 169223, 266286, 753840, 754168, 4535, 217328, 226579, 4627, 547022, 441694, 832400, 4373, 156191, 444045, 213280, 46078, 439755, 599620, 449591, 864918, 293579, 360609, 742549, 98528, 4459, 292254, 64671, 5339, 442645, 736047, 214798, 77204, 460156, 6219, 748771, 872054, 363027, 73420, 70713, 440406, 481193, 195937, 39133, 203903, 865356, 336824, 865972, 464662, 90967, 450422, 292865, 335940, 764284, 447565, 294246, 436231, 98572, 746722, 742583, 740054, 629521, 293161, 199571, 601478, 473301, 463658, 294223, 740500, 544797, 221936, 741029, 837191, 205536, 444321, 162532, 745411, 369078, 754791, 594161, 4706, 244880, 261056, 623192, 440305, 476052, 474249, 547126, 4383, 632635, 268220, 479896, 131125, 591782, 215263, 619760, 460457, 4608, 545785, 268100, 294398, 4486, 437677, 886972, 131190, 283992, 222436, 375332, 136584, 293342, 444489, 65643, 260906, 32884, 742753, 586923, 871374, 831775, 205349, 454880, 137218, 753979, 746735, 615850, 460565, 448455, 601422, 440599, 547381, 235617, 17789, 294027, 615007, 293675, 637202, 457865, 293053, 98508, 435545, 204465, 114665, 460271, 614320, 456642, 4503, 438415, 136943, 199809, 255458, 369708, 370177, 752511, 354636, 227168, 544875, 358526, 546713, 439664, 361771, 98389, 188601, 335967, 45856, 381344, 586628, 764624, 755072, 168292, 458640, 592563, 469495, 223571, 627026, 839022, 4712, 361437, 743585, 236002, 619069, 546819, 599578, 593870, 620446, 870371, 865566, 334838, 469748, 4605, 217326, 473020, 454192, 292584, 295164, 77169, 4743, 133268, 356793, 615182, 292991, 4376, 109327, 450176, 267699, 65097, 456231, 169743, 134027, 101903, 4757, 448823, 756523, 445479, 209967, 188671, 246813, 179857, 764628, 274669, 742772, 204260, 591873, 4628, 360872, 602374, 169553, 586644, 240881, 360145, 268108, 335770, 473091, 466335, 742128, 353551, 443745, 868243, 598232, 209580, 884123, 444070, 226382, 832057, 434950, 267804, 466942, 450412, 359626, 179676, 477161, 373518, 467554, 443359, 589482, 545660, 449424, 294619, 467270, 367507, 241110, 866233, 886978, 699587, 267554, 204614, 443474, 169574, 4666, 214042, 131151, 292311, 294081, 448541, 764895, 177462, 546138, 108445, 594757, 469195, 435197, 412293, 599077, 267600, 4631, 749086, 148021, 472715, 631633, 610416, 456056, 464062, 4714, 632422, 4683, 867056, 359251, 882066, 615153, 378662, 117005, 434132, 745807, 444559, 361189, 619581, 203068, 209845, 372100, 205338, 444219, 750601, 40235, 882957, 98489, 379574, 777964, 888860, 241090, 368101, 355669, 470571, 439580, 39149, 107643, 460498, 591133, 354069, 869584, 754663, 547230, 598572, 155687, 619113, 165121, 102083, 454214, 294272, 588724, 234244, 869336, 474660, 240886, 595599, 545404, 597969, 16768, 116438, 435678, 602806, 458542, 358913, 437667, 293091, 4555, 869082, 4600, 204265, 256988, 760340, 4408, 607111, 4733, 361055, 756307, 355734, 115145, 438540, 587392, 293337, 409297, 830603, 203529, 116866, 137641, 360974, 146865, 699209, 607314, 442051, 268313, 545281, 888741, 830731, 171659, 459398, 442125, 4436, 269067, 70849, 275367, 411480, 358300, 138804, 869553, 195079, 45705, 463192, 4441, 620171, 370843, 871515, 98549, 229037, 455092, 214958, 805277, 437029, 369775, 221846, 136789, 607908, 294338, 114830, 294244, 871569, 602657, 9918, 463386, 244401, 4704, 471029, 237132, 587811, 375422, 460928, 466593, 374973, 434449, 473190, 107115, 162220, 465597, 596500, 195021, 745777, 168662, 469541, 607966, 241140, 182221, 213771, 98838, 865709, 64850, 65584, 109123, 4405, 335242, 367057, 362322, 458733, 867594, 107713, 293377, 613435, 354960, 131365, 127822, 466066, 545521, 122223, 293129, 412563, 745949, 465627, 764992, 374511, 545761, 209942, 166378, 867047, 469929, 867307, 547364, 433529, 56993, 865922, 441534, 292486, 294036, 443962, 742613, 98388, 253418, 615483, 32817, 545549, 4621, 179935, 457835, 640959, 7647, 171056, 616692, 116550, 4537, 634254, 454433, 869729, 205728, 205442, 759597, 614546, 595277, 4458, 545542, 443040, 116192, 179733, 545618, 608754, 870626, 745635, 593631, 371502, 281560, 209966, 177432, 4498, 439561, 85798, 602236, 477521, 592228, 378494, 45061, 4418, 622800, 221368, 440778, 217230, 545713, 356684, 32779, 547393, 293788, 546575, 438986, 466170, 766614, 465367, 757620, 476401, 222118, 455437, 370559, 221274, 866480, 336692, 623467, 865804, 179660, 764304, 287461, 455957, 359304, 156465, 753165, 204791, 9037, 108839, 615061, 364259, 169644, 354891, 353336, 743667, 868822, 753327, 294342, 455348, 294403, 751564, 171009, 610306, 482214, 744743, 590727, 369277, 742777, 4553, 546025, 546543, 468130, 4590, 444480, 745143, 437888, 92624, 456565, 98584, 6320, 32373, 168566, 620991, 373092, 150134, 753186, 237271, 4587, 446181, 214422, 831458, 614457, 4951, 293137, 353272, 91396, 287961, 168788, 254375, 98382, 466443, 363826, 244460, 293183, 448597, 4433, 546035, 546325, 100370, 606439, 98774, 204313, 4737, 245805, 441558, 253507, 450301, 205127, 363320, 868897, 213396, 4754, 4331, 440751, 882219, 545575, 593071, 213855, 805322, 699354, 168934, 880434, 133783, 449668, 865401, 451220, 437281, 292988, 408808, 546066, 4396, 757233, 594232, 294003, 357102, 214895, 4649, 444597, 116219, 222381, 356451, 755134, 261187, 4751, 294962, 439885, 455855, 470732, 594482, 473170, 200124, 865519, 545893, 832804, 293490, 546289, 759276, 869493, 433343, 202983, 754184, 90842, 441410, 546191, 292783, 451485, 275524, 234124, 481525, 446861, 180666, 4730, 7766, 214100, 868615, 433477, 267330, 433263, 447632, 107638, 199624, 368364, 468994, 137477, 878242, 204932, 8916, 245195, 335440, 446351, 275333, 591475, 88248, 434803, 868778, 608046, 261808, 4424, 4516, 455976, 444140, 4342, 598315, 444105, 619013, 546388, 450665, 547013, 39875, 653978, 443700, 742063, 370238, 547059, 408802, 109190, 4719, 107807, 213164, 433338, 476488, 231189, 438999, 476677, 545686, 268982, 293102, 480954, 168161, 122921, 234238, 102115, 108648, 733473, 597891, 588896, 434135, 371400, 17492, 17916, 156282, 882139, 206245, 882442, 360715, 231120, 755483, 464972, 294173, 589471, 467180, 4699, 730294, 433933, 4520, 443403, 436056, 606757, 170670, 106603, 241011, 369599, 746126, 871158, 805522, 439977, 868918, 10191, 292567, 366798, 139286, 267617, 39210, 464223, 294442, 545959, 436776, 409472, 4370, 4544, 293559, 866226, 744069, 874733, 588503, 295106, 98887, 452593, 446296, 546966, 756285, 133989, 544945, 833965, 261873, 470457, 292041, 221763, 546264, 742467, 245069, 444018, 378764, 754435, 607778, 737239, 545956, 354488, 729598, 359150, 546353, 102016, 764146, 137891, 619487, 600918, 274325, 123304, 442562, 109437, 443447, 164757, 699191, 4473, 236483, 167337, 131145, 98306, 619478, 461315, 114247, 448649, 590372, 131380, 639322, 204335, 434306, 244122, 359413, 470587, 450997, 546526, 10136, 433665, 638442, 294647, 268735, 240857, 148000, 361081, 209632, 362637, 614153, 117475, 199726, 474810, 134034, 367825, 631756, 130275, 294165, 156094, 411354, 620686, 368228, 464058, 468281, 735510, 864509, 467432, 357668, 464680, 471456, 65583, 546951, 73380, 162696, 544732, 590264, 623226, 740496, 209584, 597735, 293784, 460143, 482045, 765071, 594402, 209637, 606702, 4748, 16838, 777955, 222107, 223606, 614169, 738811, 448390, 292528, 9078, 596087, 630704, 293114, 480607, 168343, 471467, 90696, 438168, 148327, 547006, 204788, 204843, 545544, 477643, 243885, 123010, 736370, 357420, 464048, 9188, 222032, 750551, 449585, 146980, 138259, 446976, 471293, 746898, 746804, 357072, 223604, 114707, 754690, 457233, 337277, 866467, 294691, 743276, 453223, 209935, 462993, 445786, 187483, 4541, 457502, 164985, 4409, 221938, 544893, 45685, 545610, 477296, 434604, 163, 363622, 748891, 133821, 626711, 461227, 292585, 108512, 356042, 4570, 214475, 4462, 625910, 293810, 438382, 179737, 781, 4529, 857121, 356445, 253229, 370757, 228213, 447771, 124013, 293289, 181200, 441323, 233996, 4738, 547451, 468821, 438606, 598211, 835419, 448830, 131245, 181846, 213665, 244937, 882630, 410173, 472866, 758964, 163583, 356198, 805433, 124002, 752726, 31617, 598086, 229270, 744003, 43055, 114301, 105867, 764599, 759866, 471957, 462725, 4685, 752335, 221471, 156049, 439925, 589497, 546419, 641037, 139207, 107806, 293823, 371602, 381800], \'batch_size\': 128}"
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 11
    group: 1
    stride: 4
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    stride: 1
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    stride: 1
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    stride: 1
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "score"
  type: "InnerProduct"
  bottom: "fc7"
  top: "score"
  inner_product_param {
    num_output: 204
  }
}
layer {
  name: "loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "score"
  bottom: "label"
  top: "loss"
}
